T11MCMP  DFHMSD TYPE=(MAP,DSECT),                                      X
               MODE=INOUT,                                             X
               LANG=COBOL,                                             X
               STORAGE=AUTO,                                           X
               MAPATTS=(COLOR,HILIGHT),                                X
               DSATTS=(COLOR,HILIGHT),                                 X
               CTRL=(FREEKB,ALARM,FRSET),                              X
               TIOAPFX=YES
MAPACMP  DFHMDI SIZE=(24,80),                                          X
               LINE=1,                                                 X
               COLUMN=1
* --- LINHA 1: TITULO + DESENVOLVEDOR
         DFHMDF POS=(01,02),                                           X
               LENGTH=14,                                              X
               ATTRB=(ASKIP,BRT),                                      X
               INITIAL='CAMPO MINADO',                                 X
               COLOR=BLUE
         DFHMDF POS=(01,47),                                           X
               LENGTH=31,                                              X
               ATTRB=(ASKIP,BRT,FSET),                                 X
               INITIAL='DESENVOLVIDO POR RAQUEL E LUCAS',              X
               COLOR=BLUE
* --- LINHA 2: NOME DO JOGADOR E PONTUACAO
         DFHMDF POS=(02,01),                                           X
               LENGTH=08,                                              X
               ATTRB=(ASKIP,BRT,FSET),                                 X
               INITIAL='JOGADOR:',                                     X
               COLOR=BLUE
NOMEJ    DFHMDF POS=(02,10),                                           X
               LENGTH=20,                                              X
               ATTRB=(PROT,BRT),                                       X
               PICOUT='X(20)'
         DFHMDF POS=(02,33),                                           X
               LENGTH=10,                                              X
               ATTRB=(ASKIP,BRT,FSET),                                 X
               INITIAL='PONTUACAO:',                                   X
               COLOR=BLUE
PONTJ    DFHMDF POS=(02,44),                                           X
               LENGTH=04,                                              X
               ATTRB=(PROT,BRT),                                       X
               PICOUT='9(04)'
* --- LINHAS 4-19: TABULEIRO (8 LINHAS X 2 LINHAS CADA)
* --- LINHAS 4-5-6 = LINHA 1 DO TABULEIRO
CAMP11   DFHMDF POS=(04,33),                                           X
               LENGTH=03,                                              X
               ATTRB=(PROT,BRT),                                       X
               INITIAL='   ',                                          X
               OCCURS=6,                                               X
               HILIGHT=REVERSE
CAMP12   DFHMDF POS=(05,33),                                           X
               LENGTH=03,                                              X
               ATTRB=(PROT,BRT),                                       X
               INITIAL=' ? ',                                          X
               OCCURS=6,                                               X
               HILIGHT=REVERSE
CAMP13   DFHMDF POS=(06,33),                                           X
               LENGTH=03,                                              X
               ATTRB=(PROT,BRT),                                       X
               INITIAL='   ',                                          X
               OCCURS=6,                                               X
               HILIGHT=REVERSE
* --- LINHAS 7-8-9 = LINHA 2 DO TABULEIRO
CAMP21   DFHMDF POS=(07,33),                                           X
               LENGTH=03,                                              X
               ATTRB=(PROT,BRT),                                       X
               INITIAL='   ',                                          X
               OCCURS=6,                                               X
               HILIGHT=REVERSE
CAMP22   DFHMDF POS=(08,33),                                           X
               LENGTH=03,                                              X
               ATTRB=(PROT,BRT),                                       X
               INITIAL=' ? ',                                          X
               OCCURS=6,                                               X
               HILIGHT=REVERSE
CAMP23   DFHMDF POS=(09,33),                                           X
               LENGTH=03,                                              X
               ATTRB=(PROT,BRT),                                       X
               INITIAL='   ',                                          X
               OCCURS=6,                                               X
               HILIGHT=REVERSE
* --- LINHAS 10-11-12 = LINHA 3 DO TABULEIRO
CAMP31   DFHMDF POS=(10,33),                                           X
               LENGTH=03,                                              X
               ATTRB=(PROT,BRT),                                       X
               INITIAL='   ',                                          X
               OCCURS=6,                                               X
               HILIGHT=REVERSE
CAMP32   DFHMDF POS=(11,33),                                           X
               LENGTH=03,                                              X
               ATTRB=(PROT,BRT),                                       X
               INITIAL=' ? ',                                          X
               OCCURS=6,                                               X
               HILIGHT=REVERSE
CAMP33   DFHMDF POS=(12,33),                                           X
               LENGTH=03,                                              X
               ATTRB=(PROT,BRT),                                       X
               INITIAL='   ',                                          X
               OCCURS=6,                                               X
               HILIGHT=REVERSE
* --- LINHAS 13-14-15 = LINHA 4 DO TABULEIRO
CAMP41   DFHMDF POS=(13,33),                                           X
               LENGTH=03,                                              X
               ATTRB=(PROT,BRT),                                       X
               INITIAL='   ',                                          X
               OCCURS=6,                                               X
               HILIGHT=REVERSE
CAMP42   DFHMDF POS=(14,33),                                           X
               LENGTH=03,                                              X
               ATTRB=(PROT,BRT),                                       X
               INITIAL=' ? ',                                          X
               OCCURS=6,                                               X
               HILIGHT=REVERSE
CAMP43   DFHMDF POS=(15,33),                                           X
               LENGTH=03,                                              X
               ATTRB=(PROT,BRT),                                       X
               INITIAL='   ',                                          X
               OCCURS=6,                                               X
               HILIGHT=REVERSE
* --- LINHAS 16-17-18 = LINHA 5 DO TABULEIRO
CAMP51   DFHMDF POS=(16,33),                                           X
               LENGTH=03,                                              X
               ATTRB=(PROT,BRT),                                       X
               INITIAL='   ',                                          X
               OCCURS=6,                                               X
               HILIGHT=REVERSE
CAMP52   DFHMDF POS=(17,33),                                           X
               LENGTH=03,                                              X
               ATTRB=(PROT,BRT),                                       X
               INITIAL=' ? ',                                          X
               OCCURS=6,                                               X
               HILIGHT=REVERSE
CAMP53   DFHMDF POS=(18,33),                                           X
               LENGTH=03,                                              X
               ATTRB=(PROT,BRT),                                       X
               INITIAL='   ',                                          X
               OCCURS=6,                                               X
               HILIGHT=REVERSE
* --- LINHAS 19-20-21 = LINHA 6 DO TABULEIRO
CAMP61   DFHMDF POS=(19,33),                                           X
               LENGTH=03,                                              X
               ATTRB=(PROT,BRT),                                       X
               INITIAL='   ',                                          X
               OCCURS=6,                                               X
               HILIGHT=REVERSE
CAMP62   DFHMDF POS=(20,33),                                           X
               LENGTH=03,                                              X
               ATTRB=(PROT,BRT),                                       X
               INITIAL=' ? ',                                          X
               OCCURS=6,                                               X
               HILIGHT=REVERSE
CAMP63   DFHMDF POS=(21,33),                                           X
               LENGTH=03,                                              X
               ATTRB=(PROT,BRT),                                       X
               INITIAL='   ',                                          X
               OCCURS=6,                                               X
               HILIGHT=REVERSE
* --- LINHAS RESTANTES
         DFHMDF POS=(05,02),                                           X
               LENGTH=10,                                              X
               ATTRB=(PROT,BRT),                                       X
               INITIAL='PRESSIONE '
         DFHMDF POS=(05,13),                                           X
               LENGTH=03,                                              X
               ATTRB=(PROT,BRT),                                       X
               INITIAL='PF1',                                          X
               HILIGHT=REVERSE,                                        X
               COLOR=GREEN
         DFHMDF POS=(05,17),                                           X
               LENGTH=04,                                              X
               ATTRB=(PROT,BRT),                                       X
               INITIAL='PARA'
         DFHMDF POS=(06,02),                                           X
               LENGTH=17,                                              X
               ATTRB=(PROT,BRT),                                       X
               INITIAL='IR PARA O GUIA DE'
         DFHMDF POS=(07,02),                                           X
               LENGTH=10,                                              X
               ATTRB=(PROT,BRT),                                       X
               INITIAL='COMO JOGAR'
         DFHMDF POS=(15,02),                                           X
               LENGTH=24,                                              X
               ATTRB=(PROT,BRT),                                       X
               INITIAL='COLOQUE O CURSOR EM CIMA'
         DFHMDF POS=(16,02),                                           X
               LENGTH=24,                                              X
               ATTRB=(PROT,BRT),                                       X
               INITIAL='DA CELULA QUE DESEJA REVELAR'
         DFHMDF POS=(17,02),                                           X
               LENGTH=11,                                              X
               ATTRB=(PROT,BRT),                                       X
               INITIAL='E PRESSIONE'
         DFHMDF POS=(17,14),                                           X
               LENGTH=11,                                              X
               ATTRB=(PROT,BRT),                                       X
               INITIAL='ENTER',                                        X
               HILIGHT=REVERSE,                                        X
               COLOR=GREEN
         DFHMDF POS=(23,01),                                           X
               LENGTH=10,                                              X
               ATTRB=(PROT,BRT),                                       X
               INITIAL='MENSAGEM:'
MENCMP   DFHMDF POS=(23,12),                                           X
               LENGTH=60,                                              X
               ATTRB=(PROT,BRT),                                       X
               PICOUT='X(60)'
*   CAMPO VARIAVEL
DATCMP   DFHMDF POS=(24,02),                                           X
               LENGTH=10,                                              X
               ATTRB=(ASKIP,BRT,FSET),                                 X
               PICOUT='X(10)'
*   CAMPO VARIAVEL
HORCMP   DFHMDF POS=(24,16),                                           X
               LENGTH=05,                                              X
               ATTRB=(ASKIP,BRT,FSET),                                 X
               PICOUT='X(05)'
*   CAMPO CONSTANTE
         DFHMDF POS=(24,26),                                           X
               LENGTH=05,                                              X
               ATTRB=(ASKIP,BRT,FSET),                                 X
               INITIAL='FASE:'
FASCMP   DFHMDF POS=(24,32),                                           X
               LENGTH=02,                                              X
               ATTRB=(ASKIP,BRT,FSET),                                 X
               PICOUT='9(02)'
*   CAMPO CONSTANTE
         DFHMDF POS=(24,37),                                           X
               LENGTH=05,                                              X
               ATTRB=(ASKIP,BRT,FSET),                                 X
               INITIAL='TASK:'
*   CAMPO VARIAVEL
TASCMP   DFHMDF POS=(24,43),                                           X
               LENGTH=06,                                              X
               ATTRB=(ASKIP,BRT,FSET),                                 X
               PICOUT='9(06)'
*   CAMPO CONSTANTE
         DFHMDF POS=(24,50),                                           X
               LENGTH=09,                                              X
               ATTRB=(ASKIP,BRT,FSET),                                 X
               INITIAL='TERMINAL:'
*   CAMPO VARIAVEL
TERCMP   DFHMDF POS=(24,60),                                           X
               LENGTH=04,                                              X
               ATTRB=(ASKIP,BRT,FSET),                                 X
               PICOUT='9(04)'
*   CAMPO CONSTANTE
         DFHMDF POS=(24,65),                                           X
               LENGTH=10,                                              X
               ATTRB=(ASKIP,BRT,FSET),                                 X
               INITIAL='TRANSACAO:'
*   CAMPO VARIAVEL
TRACMP   DFHMDF POS=(24,76),                                           X
               LENGTH=04,                                              X
               ATTRB=(ASKIP,BRT,FSET),                                 X
               PICOUT='9(04)'
         DFHMSD TYPE=FINAL
         END
