       01  MAPACADI.
           02  FILLER PIC X(12).
           02  NOMCADL    COMP  PIC  S9(4).
           02  NOMCADF    PICTURE X.
           02  FILLER REDEFINES NOMCADF.
             03 NOMCADA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  NOMCADI  PIC X(30).
           02  DIACADL    COMP  PIC  S9(4).
           02  DIACADF    PICTURE X.
           02  FILLER REDEFINES DIACADF.
             03 DIACADA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  DIACADI  PIC 9(02).
           02  MESCADL    COMP  PIC  S9(4).
           02  MESCADF    PICTURE X.
           02  FILLER REDEFINES MESCADF.
             03 MESCADA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  MESCADI  PIC 9(02).
           02  ANOCADL    COMP  PIC  S9(4).
           02  ANOCADF    PICTURE X.
           02  FILLER REDEFINES ANOCADF.
             03 ANOCADA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  ANOCADI  PIC 9(04).
           02  CPFCADL    COMP  PIC  S9(4).
           02  CPFCADF    PICTURE X.
           02  FILLER REDEFINES CPFCADF.
             03 CPFCADA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  CPFCADI  PIC X(11).
           02  USUCADL    COMP  PIC  S9(4).
           02  USUCADF    PICTURE X.
           02  FILLER REDEFINES USUCADF.
             03 USUCADA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  USUCADI  PIC X(20).
           02  EMACADL    COMP  PIC  S9(4).
           02  EMACADF    PICTURE X.
           02  FILLER REDEFINES EMACADF.
             03 EMACADA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  EMACADI  PIC X(30).
           02  SENCADL    COMP  PIC  S9(4).
           02  SENCADF    PICTURE X.
           02  FILLER REDEFINES SENCADF.
             03 SENCADA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  SENCADI  PIC X(20).
           02  MENCADL    COMP  PIC  S9(4).
           02  MENCADF    PICTURE X.
           02  FILLER REDEFINES MENCADF.
             03 MENCADA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  MENCADI  PIC X(60).
           02  DASCADL    COMP  PIC  S9(4).
           02  DASCADF    PICTURE X.
           02  FILLER REDEFINES DASCADF.
             03 DASCADA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  DASCADI  PIC X(10).
           02  HOSCADL    COMP  PIC  S9(4).
           02  HOSCADF    PICTURE X.
           02  FILLER REDEFINES HOSCADF.
             03 HOSCADA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  HOSCADI  PIC X(5).
           02  FASCADL    COMP  PIC  S9(4).
           02  FASCADF    PICTURE X.
           02  FILLER REDEFINES FASCADF.
             03 FASCADA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  FASCADI  PIC X(2).
           02  TASCADL    COMP  PIC  S9(4).
           02  TASCADF    PICTURE X.
           02  FILLER REDEFINES TASCADF.
             03 TASCADA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  TASCADI  PIC X(6).
           02  TERLOGL    COMP  PIC  S9(4).
           02  TERLOGF    PICTURE X.
           02  FILLER REDEFINES TERLOGF.
             03 TERLOGA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  TERLOGI  PIC X(4).
           02  TRALOGL    COMP  PIC  S9(4).
           02  TRALOGF    PICTURE X.
           02  FILLER REDEFINES TRALOGF.
             03 TRALOGA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  TRALOGI  PIC X(4).
       01  MAPACADO REDEFINES MAPACADI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  NOMCADC    PICTURE X.
           02  NOMCADH    PICTURE X.
           02  NOMCADO  PIC X(30).
           02  FILLER PICTURE X(3).
           02  DIACADC    PICTURE X.
           02  DIACADH    PICTURE X.
           02  DIACADO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  MESCADC    PICTURE X.
           02  MESCADH    PICTURE X.
           02  MESCADO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  ANOCADC    PICTURE X.
           02  ANOCADH    PICTURE X.
           02  ANOCADO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  CPFCADC    PICTURE X.
           02  CPFCADH    PICTURE X.
           02  CPFCADO  PIC X(11).
           02  FILLER PICTURE X(3).
           02  USUCADC    PICTURE X.
           02  USUCADH    PICTURE X.
           02  USUCADO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  EMACADC    PICTURE X.
           02  EMACADH    PICTURE X.
           02  EMACADO  PIC X(30).
           02  FILLER PICTURE X(3).
           02  SENCADC    PICTURE X.
           02  SENCADH    PICTURE X.
           02  SENCADO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  MENCADC    PICTURE X.
           02  MENCADH    PICTURE X.
           02  MENCADO PIC X(60).
           02  FILLER PICTURE X(3).
           02  DASCADC    PICTURE X.
           02  DASCADH    PICTURE X.
           02  DASCADO PIC 9(10).
           02  FILLER PICTURE X(3).
           02  HOSCADC    PICTURE X.
           02  HOSCADH    PICTURE X.
           02  HOSCADO PIC 9(05).
           02  FILLER PICTURE X(3).
           02  FASCADC    PICTURE X.
           02  FASCADH    PICTURE X.
           02  FASCADO PIC 9(02).
           02  FILLER PICTURE X(3).
           02  TASCADC    PICTURE X.
           02  TASCADH    PICTURE X.
           02  TASCADO PIC 9(06).
           02  FILLER PICTURE X(3).
           02  TERLOGC    PICTURE X.
           02  TERLOGH    PICTURE X.
           02  TERLOGO PIC 9(04).
           02  FILLER PICTURE X(3).
           02  TRALOGC    PICTURE X.
           02  TRALOGH    PICTURE X.
           02  TRALOGO PIC 9(04).
