      *================================================================*
       IDENTIFICATION                  DIVISION.
      *================================================================*

       PROGRAM-ID.                     CASCA1.
       AUTHOR.                         LUCAS LIMA.

      *================================================================*
      *                 FOURSYS - FABRICA DE SOFTWARES                 *
      *----------------------------------------------------------------*
      *    PROGRAMA....: CASCA1                                        *
      *    PROGRAMADOR.: LUCAS LIMA                                    *
      *    ANALISTA....: DALSON CAIVANO                                *
      *    DATA........: AGOSTO/2025                                   *
      *----------------------------------------------------------------*       
      *    OBJETIVO......: PROGRAMA BACKUP DE ESTRUTURA ARQUIVO        *
      *----------------------------------------------------------------*
      *    ARQUIVOS - DESCREVER...                                     *
      *                                                                *
      *----------------------------------------------------------------*
      *----------------------------------------------------------------*
      *    MODULO......:                                               *
      *================================================================*

      *================================================================*
       ENVIRONMENT                     DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       CONFIGURATION                   SECTION.
      *----------------------------------------------------------------*
       SPECIAL-NAMES.
           DECIMAL-POINT               IS COMMA.

      *----------------------------------------------------------------*
       INPUT-OUTPUT SECTION.
      *----------------------------------------------------------------*
       FILE-CONTROL.

      *----------------------------------------------------------------*       
      *    SELECT *NOME DO ARQUIVO*...                                 *
      *----------------------------------------------------------------*
           SELECT  ARQENT  ASSIGN      TO  ARQENT
                   FILE      STATUS    IS  WRK-FS-ARQENT.

           SELECT  ARQSAI  ASSIGN      TO  ARQSAI
                   FILE      STATUS    IS  WRK-FS-ARQSAI.

      *================================================================*
       DATA                            DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       FILE SECTION.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      *   INPUT:  ARQUIVO  VARIOSLO                                    *
      *            ORG. SEQUENCIAL  -  LRECL = ***                     *
      *----------------------------------------------------------------*
       FD  ARQENT
           RECORDING MODE IS F
           LABEL RECORD   IS STANDARD
           BLOCK CONTAINS 0 RECORDS.
       01  WRK-FD-REG-ARQENT           PIC X(400).

      *----------------------------------------------------------------*
      *   OUTPUT:  ARQUIVO  UNICOLOT                                   *
      *            ORG. SEQUENCIAL  -  LRECL = ***                     *
      *----------------------------------------------------------------*
       FD  ARQSAI
           RECORDING MODE IS F
           LABEL RECORD   IS STANDARD
           BLOCK CONTAINS 0 RECORDS.
       01  WRK-FD-REG-ARQSAI           PIC X(400).

      *================================================================*
       WORKING-STORAGE                 SECTION.
      *================================================================*

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(040)         VALUE
           '*** INICIO DA AREA DE WORKING ***      '.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(040)         VALUE
           '* VARIAVEIS DE FILE-STATUS *'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  WRK-FS-ARQENT               PIC  X(002)         VALUE SPACES.
       01  WRK-FS-ARQSAI               PIC  X(002)         VALUE SPACES.
       01  WRK-ABERTURA                PIC  X(013)         VALUE
                                                          'NA ABERTURA'.
       01  WRK-LEITURA                 PIC  X(013)         VALUE
                                                           'NA LEITURA'.
       01  WRK-FECHAMENTO              PIC  X(013)         VALUE
                                                        'NO FECHAMENTO'.
       01  WRK-BATCH                   PIC  X(008)         VALUE
                                                                'BATCH'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE ACUMULADORES ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-ACU-LIDOS               PIC  9(009) COMP-3  VALUE ZEROS.
       01  WRK-ACU-GRAVADOS            PIC  9(009) COMP-3  VALUE ZEROS.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE CONTADORES ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-CT-LIDOS                PIC  9(009) COMP-3  VALUE ZEROS.

       01  WRK-CT-GRAVADOS             PIC  9(009) COMP-3  VALUE ZEROS.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA PARA VARIAVEIS AUXILIARES ***'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       
       01  WRK-FIM-ARQ                 PIC  X(001)         VALUE SPACES.

       01  WRK-EDIT                    PIC  ZZZ.ZZZ.ZZ9    VALUE ZEROS.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      
       01  FILLER                      PIC  X(050)         VALUE
           '* MENSAGENS DE ERRO *'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-MSG-FS-ERRO.
           05 FILLER                   PIC  X(010)         VALUE SPACES.
           05 FILLER                   PIC  X(005)         VALUE 'ERRO'.
           05 WRK-OPERACAO             PIC  X(013)         VALUE SPACES.
           05 FILLER                   PIC  X(012)         VALUE
                                                           'DO ARQUIVO'.
           05 WRK-NOME-ARQ             PIC  X(009)         VALUE SPACES.
           05 FILLER                   PIC  X(014)         VALUE
                                                       'FILE STATUS = '.
           05 WRK-FILE-STATUS          PIC  X(002)         VALUE SPACES.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA PARA TRATAMENTO DE ERROS ***'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

      * COPY ROTERRO.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE ARQUIVOS ***             '.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

      * COPY *******.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  FILLER                      PIC  X(050)         VALUE
           '*** FIM DA AREA DE WORKING ***'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       LINKAGE SECTION.
      * 01  LNK-PARM-CLIENTE.
      *     05  LNK-TAM-PARM           PIC 9(004) COMP.
      *     05  LNK-PARAMETRO          PIC X(020).

      *================================================================*
       PROCEDURE DIVISION.               
      *================================================================*
      *================================================================*
      *PROCEDURE DIVISION             USING LNK-PARM-CLIENTE.
      *================================================================*

      *----------------------------------------------------------------*
       0000-PRINCIPAL                  SECTION.
      *----------------------------------------------------------------*

           PERFORM  1000-INICIALIZAR

           PERFORM  2000-PROCESSAR

           PERFORM  3000-FINALIZAR.

      *----------------------------------------------------------------*
           EXIT.
      *----------------------------------------------------------------*
      *----------------------------------------------------------------*
       1000-INICIALIZAR                SECTION.
      *----------------------------------------------------------------*

           OPEN  INPUT                 ARQENT

           IF  WRK-FS-ARQENT  NOT EQUAL  '00' AND '10'
               MOVE  'ARQENT'          TO WRK-NOME-ARQ
               MOVE  WRK-FS-ARQENT     TO WRK-FILE-STATUS
               PERFORM  9999-ROTINA-ERRO
           END-IF

           OPEN  OUTPUT                ARQSAI

           IF  WRK-FS-ARQSAI  NOT EQUAL  '00' AND '10'
               MOVE  'ARQSAI'          TO WRK-NOME-ARQ
               MOVE  WRK-FS-ARQSAI     TO WRK-FILE-STATUS
               PERFORM  9999-ROTINA-ERRO
           END-IF.

      *     MOVE SPACES                 TO ERRO-AREA

           MOVE WRK-ABERTURA           TO WRK-OPERACAO

           PERFORM 9000-VERIFICAR-VAZIO 

           PERFORM 9100-LER-ARQENT
             UNTIL (XXXXXXXXXXXXXXXXXX EQUAL LNK-PARAMETRO AND
                    XXXXXXXXXXXXXXX    EQUAL ZEROS)
                                       OR
                    WRK-FIM-ARQ        EQUAL 'S'.

      *----------------------------------------------------------------*
           EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2000-PROCESSAR                  SECTION.
      *----------------------------------------------------------------*
      * ADICIONAR A LOGICA DE PROCESSAMENTO AQUI                       *
           PERFORM  9200-GRAVAR-ARQSAI UNTIL
                                         ************* EQUAL ?

           PERFORM  9200-GRAVAR-ARQSAI.

      *----------------------------------------------------------------*
           EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       3000-FINALIZAR                  SECTION.
      *----------------------------------------------------------------*

           CLOSE  ARQENT

           IF  WRK-FS-ARQENT  NOT EQUAL  '00' AND '10'
               MOVE  'ARQENT'          TO WRK-NOME-ARQ
               MOVE  WRK-FS-ARQENT     TO WRK-FILE-STATUS
               PERFORM  9999-ROTINA-ERRO
           END-IF

           CLOSE ARQSAI

           IF  WRK-FS-ARQSAI  NOT EQUAL  '00' AND '10'
               MOVE  'ARQSAI'          TO WRK-NOME-ARQ
               MOVE  WRK-FS-ARQSAI     TO WRK-FILE-STATUS
               PERFORM  9999-ROTINA-ERRO
           END-IF     

           PERFORM 9300-DISPLAY-PROCESSAMENTO  

           STOP RUN.

      *----------------------------------------------------------------*
           EXIT.
      *----------------------------------------------------------------*

     
      *----------------------------------------------------------------*
       9000-VERIFICAR-VAZIO            SECTION.
      *----------------------------------------------------------------*

           PERFORM  9100-LER-ARQENT

           IF  WRK-FIM-ARQ  EQUAL  'S'
               DISPLAY '********** VARIOSLO **********'
               DISPLAY '*                            *'
               DISPLAY '*   ARQUIVO VARIOSLO VAZIO   *'
               DISPLAY '*   PROGRAMA CANCELADO       *'
               DISPLAY '*                            *'
               DISPLAY '********** VARIOSLO **********'

               MOVE 'ARQENT'           TO WRK-NOME-ARQ

               PERFORM  3000-FINALIZAR
           END-IF.

      *----------------------------------------------------------------*
           EXIT.
      *----------------------------------------------------------------*
      *----------------------------------------------------------------*
       9100-LER-ARQENT                 SECTION.
      *----------------------------------------------------------------*

           READ  ARQENT                INTO  WRK-FD-REG-ARQENT

           IF  WRK-FS-ARQENT  NOT EQUAL  '00' AND '10'
               MOVE  'ARQENT'          TO WRK-NOME-ARQ
               MOVE  WRK-FS-ARQENT     TO WRK-FILE-STATUS
               PERFORM  9999-ROTINA-ERRO
           END-IF

           MOVE  WRK-LEITURA           TO  WRK-OPERACAO

           IF  WRK-FS-ARQENT  EQUAL  '10'
               MOVE  'S'               TO  WRK-FIM-ARQ
           END-IF

           ADD 1 TO WRK-ACU-LIDOS

      *----------------------------------------------------------------*
           EXIT.
      *----------------------------------------------------------------*
      *----------------------------------------------------------------*
       9200-GRAVAR-ARQSAI              SECTION.
      *----------------------------------------------------------------*

           WRITE  WRK-FD-REG-ARQSAI    FROM **********

           IF  WRK-FS-ARQSAI  NOT EQUAL  '00' AND '10'
               MOVE  'ARQSAI'          TO WRK-NOME-ARQ
               MOVE  WRK-FS-ARQSAI     TO WRK-FILE-STATUS
               PERFORM  9999-ROTINA-ERRO
           END-IF       

           ADD   1                     TO WRK-ACU-GRAVADOS

           PERFORM 9100-LER-ARQENT.

      *----------------------------------------------------------------*
           EXIT.
      *----------------------------------------------------------------*
      *----------------------------------------------------------------*
       9300-DISPLAY-PROCESSAMENTO      SECTION.
      *----------------------------------------------------------------*

           DISPLAY
           '********************** CASCA **************************'.
           DISPLAY
           '*                                                     *'
           DISPLAY
           '*             ESTATISTICA DE PROCESSAMENTO            *'
           DISPLAY
           '*                                                     *'

      *     MOVE  WRK-ACU-LIDOS             TO  WRK-EDIT
           DISPLAY
           '* REGISTROS LIDOS NO ********   .......= '          ' *'

      *     MOVE  WRK-ACU-GRAVADOS          TO  WRK-EDIT
           DISPLAY
           '* REGISTROS GRAVADOS NO ********.......= '          ' *'

           DISPLAY
           '*                                                     *'
           DISPLAY
           '********************** CASCA **************************'.

      *----------------------------------------------------------------*
           EXIT.
      *----------------------------------------------------------------*
      *----------------------------------------------------------------*
       9999-ROTINA-ERRO                SECTION.
      *----------------------------------------------------------------*

      *     MOVE  'CBTI9970'           TO  ********
      *     MOVE  'APL'                TO  ********

      *     MOVE  WRK-MSG-FS-ERRO      TO  ********

      *     CALL  'BRAD7100'           USING  WRK-********
                                               
           PERFORM 3000-FINALIZAR.

      *----------------------------------------------------------------*
           EXIT.
      *----------------------------------------------------------------*
