      *                                                                 00060004
      *--------------------------------------------------------------*  00010004
       IDENTIFICATION                      DIVISION.                    00020004
      *--------------------------------------------------------------*  00030004
      *                                                                 00060004
       PROGRAM-ID.                         CURSOR7.                     00040008
       AUTHOR.                             LUCAS.                       00050008
      *                                                                 00060004
      *--------------------------------------------------------------*  00070004
       ENVIRONMENT                         DIVISION.                    00080004
      *--------------------------------------------------------------*  00090004
      *                                                                 00060004
       CONFIGURATION                       SECTION.                     00100004
       SPECIAL-NAMES.                                                   00110004
           DECIMAL-POINT IS COMMA.                                      00120004
      *                                                                 00060004
       INPUT-OUTPUT                        SECTION.                     00110004
      *                                                                 00060004
       FILE-CONTROL.
           SELECT TTCOMPRA ASSIGN TO UT-S-TTCOMPRA
           FILE STATUS IS FS-TTCOMPRA
           .
      *
      *--------------------------------------------------------------*  00130004
       DATA                                DIVISION.                    00140004
      *--------------------------------------------------------------*  00210008
       FILE                                SECTION.                     00160004
      *--------------------------------------------------------------*  00210008
       FD  TTCOMPRA
           LABEL RECORD OMITTED
           RECORDING MODE IS F
           RECORD CONTAINS 14 CHARACTERS
           DATA RECORD REG-TTCOMPRA
           .
      *
           COPY COMPRAFO.
      *--------------------------------------------------------------*  00210008
       WORKING-STORAGE                     SECTION.                     00160004
      *--------------------------------------------------------------*
      * BOOK DAS VARIAVEIS PARA CALCULO DO TEMPO                     *
      *--------------------------------------------------------------*
           COPY VARDATA.
           COPY VARPROC.
      *
      *--------------------------------------------------------------*
      * BOOK DAS VARIAVEIS HOSPEDEIRAS                               *
      *--------------------------------------------------------------*
           EXEC SQL
              INCLUDE DCLCOMP
           END-EXEC.
      *
      *--------------------------------------------------------------*
      * BOOK DAS VARIAVEIS PARA O SQL                                *
      *--------------------------------------------------------------*
           EXEC SQL
             INCLUDE SQLCA
           END-EXEC.
      *
       01  WS-CONTADORES-COMP.
           05 WS-CTLIDO                    PIC 9(05) COMP.
           05 WS-CTINS                     PIC 9(05) COMP.
           05 WS-CTEXC                     PIC 9(05) COMP.
           05 WS-CTINV                     PIC 9(05) COMP.
           05 WS-CTALT                     PIC 9(05) COMP.
           05 WS-CTCON                     PIC 9(05) COMP.
      *
       01  WS-CONTADORES-FORMATADOS.
           05 WS-CTLIDO-F                  PIC ZZ.ZZ9.
           05 WS-CTINS-F                   PIC ZZ.ZZ9.
           05 WS-CTEXC-F                   PIC ZZ.ZZ9.
           05 WS-CTINV-F                   PIC ZZ.ZZ9.
           05 WS-CTALT-F                   PIC ZZ.ZZ9.
           05 WS-CTCON-F                   PIC ZZ.ZZ9.
      *
       01  FS-TTCOMPRA                     PIC X(02).
           88 SUCESSO-TTCOMPRA                     VALUE "00".
      *    88 FIM-ARQ-TTCOMPRA                     VALUE "10".
      *
      *77  WS-SALDOCLIE-F                  PIC ZZ.ZZ9,99.
       77  WS-SQLCODE                      PIC +9(9).
       77  WS-MSG                          PIC X(60).
       77  WS-FS                           PIC X(02).
      *

       77  WS-IDFORNEC-AUX                 PIC S9(9) COMP.
       77  WS-TIPOCOMPRA-AUX               PIC S9(9) COMP.
       77  WS-VALORTOTAL                   PIC S9(8)V9(2) COMP-3.
       77  WS-VALOR-AUX                    PIC S9(8)V9(2) COMP-3.
      *--------------------------------------------------------------*  00210008
       PROCEDURE                           DIVISION.                    00140004
      *--------------------------------------------------------------*  00210008
      *0000-MAIN.
           PERFORM 1000-INICIALIZAR
           PERFORM 2000-PROCESSAR
                   UNTIL SQLCODE = +100
           PERFORM 3000-TERMINO
           STOP RUN
           .
      *
       1000-INICIALIZAR.
           ACCEPT WS-HORARIO-INICIAL FROM TIME
      *
           INITIALIZE WS-CONTADORES-COMP
      *
           EXEC SQL
               DECLARE COMPRA CURSOR FOR
                    SELECT TIPOCOMPRA
                          ,IDFORNEC
                          ,VALORCOMPRA
                    FROM TBCOMPRA
                    WHERE TIPOCOMPRA = 1 AND VALORCOMPRA >= 300 OR
                          TIPOCOMPRA = 2 AND VALORCOMPRA >= 150
                    ORDER BY IDFORNEC, TIPOCOMPRA
           END-EXEC
      *   ABERTURA DO CURSOR
           EXEC SQL
               OPEN COMPRA
           END-EXEC
      *
           IF SQLCODE NOT EQUAL 0
              MOVE "ERRO AO FECHAR CURSOR" TO WS-MSG
              MOVE SQLCODE                 TO WS-SQLCODE
              GO TO 9000-ERRO-DB2
           END-IF
      *
           OPEN OUTPUT TTCOMPRA
           IF NOT SUCESSO-TTCOMPRA
              MOVE "ERRO DE ABERTURA TTCOMPRA" TO WS-MSG
              MOVE FS-TTCOMPRA                 TO WS-FS
              GO TO 9000-ERRO
           END-IF
      *
           PERFORM 1100-LER-COMPRA
           MOVE 0                              TO WS-TIPOCOMPRA-AUX
           MOVE 0                              TO WS-VALOR-AUX
           MOVE 0                              TO WS-VALORTOTAL
           MOVE 0                              TO WS-IDFORNEC-AUX
           .
      *
       1100-LER-COMPRA.
           INITIALIZE DCLTBCOMPRA
           EXEC SQL
                FETCH COMPRA
                INTO :TIPOCOMPRA
                     ,:IDFORNEC
                     ,:VALORCOMPRA

           END-EXEC
      *
           IF SQLCODE = 0
              ADD 1 TO WS-CTLIDO
           ELSE
              IF SQLCODE NOT = +100
                 MOVE "ERRO LEITURA CURSOR COMPRA"
                                                 TO WS-MSG
                 MOVE SQLCODE                    TO WS-SQLCODE
                 GO TO 9000-ERRO-DB2
              END-IF
           END-IF
           .
      *
       2000-PROCESSAR.
           IF (IDFORNEC NOT = WS-IDFORNEC-AUX OR TIPOCOMPRA NOT =
                                              WS-TIPOCOMPRA-AUX)
               AND WS-IDFORNEC-AUX NOT = 0
               PERFORM 2300-GRAVAR-VARIAVEIS
           END-IF

           IF IDFORNEC NOT = WS-IDFORNEC-AUX OR TIPOCOMPRA NOT =
                                             WS-TIPOCOMPRA-AUX
              MOVE IDFORNEC                  TO WS-IDFORNEC-AUX
              MOVE TIPOCOMPRA                TO WS-TIPOCOMPRA-AUX
              MOVE VALORCOMPRA               TO WS-VALORTOTAL
           ELSE
              ADD VALORCOMPRA                TO WS-VALORTOTAL
           END-IF

           PERFORM 1100-LER-COMPRA
           PERFORM 2300-GRAVAR-VARIAVEIS
           .
      *
      *2100-SOMA-TIPO1.
      *    IF IDFORNEC = WS-IDFORNEC-AUX AND
      *                  TIPOCOMPRA = WS-TIPOCOMPRA-AUX
      *    COMPUTE WS-VALORTOTAL = WS-VALOR-AUX + VALORCOMPRA
      *    DISPLAY WS-VALORTOTAL
      *    END-IF
      *    .
      *
      *2200-SOMA-TIPO2.
      *    IF IDFORNEC = WS-IDFORNEC-AUX AND
      *                  TIPOCOMPRA = WS-TIPOCOMPRA-AUX
      *    COMPUTE WS-VALORTOTAL = WS-VALOR-AUX + VALORCOMPRA
      *    DISPLAY WS-VALORTOTAL
      *    END-IF
      *    .
      *
       2300-GRAVAR-VARIAVEIS.
      *------------------------------------------------------------
      * MOVER DADOS DA VARIAVEL ESPELHO PARA A HOSPEDEIRA
      *------------------------------------------------------------
           MOVE TIPOCOMPRA             TO WS-TIPOCOMPRA-AUX
           MOVE IDFORNEC               TO WS-IDFORNEC
           MOVE VALORCOMPRA            TO WS-VALORTOTAL
           WRITE REG-TBCOMPRA
           IF NOT SUCESSO-TTCOMPRA
              MOVE 'ERRO NA GRAVACAO TTCOMPRA'
                                       TO WS-MSG
              MOVE FS-TTCOMPRA         TO WS-FS
              GO TO 9000-ERRO
           END-IF
           ADD 1                       TO WS-CTINS
           MOVE 0                      TO WS-IDFORNEC-AUX
           .
      *
       3000-TERMINO.
           CLOSE TTCOMPRA
           IF NOT SUCESSO-TTCOMPRA
              MOVE "ERRO FECHAMENTO TTCOMPRA"  TO WS-MSG
              MOVE FS-TTCOMPRA                 TO WS-FS
              GO TO 9000-ERRO
           END-IF
      *
           ACCEPT WS-HORARIO-FINAL FROM TIME
      *
           PERFORM 9000-CALCULA-TEMPO-PROC
      *
           MOVE WS-CTLIDO                  TO WS-CTLIDO-F
           MOVE WS-CTINS                   TO WS-CTINS-F
      *
           PERFORM 9000-IMPRIME-DATA
      *
           DISPLAY '   '
           DISPLAY '   '
           DISPLAY '=================================================='
           DISPLAY '==  ESTATISTICA FINAL DE PROCESSAMENTO          =='
           DISPLAY '=================================================='
           DISPLAY 'QTDE. DE MOVIMENTOS LIDOS MOVPRDD2. : ' WS-CTLIDO-F
           DISPLAY 'QTDE. CLIENTES INSERIDOS TBPRODUTO. : ' WS-CTINS-F
           DISPLAY '=================================================='
           DISPLAY 'TEMPO TOTAL DE PROCESSSAMENTO........: '
                                           WS-TEMPO-PROCESSAMENTO
           DISPLAY '=================================================='
           DISPLAY '==  TERMINO NORMAL DO PROGRAMA CURSOR7          =='
           DISPLAY '=================================================='
           .
      *
       9000-ERRO-DB2.
           DISPLAY '==================================================='
           DISPLAY 'MESSAGE...:' WS-MSG
           DISPLAY 'SQLCODE...:' WS-SQLCODE
           DISPLAY '==================================================='
           DISPLAY '==  TERMINO ANORMAL DO PROGRAMA CURSOR7          =='
           DISPLAY '==================================================='
           MOVE 16                         TO RETURN-CODE
           STOP RUN
           .
      *
      *--------------------------------------------------------------*  00210008
      * COPY BOOK DE ROTINAS                                            00210008
      *--------------------------------------------------------------*  00210008
           COPY ROTDATA.
           COPY ROTERRO.
           COPY ROTPROC.
