      *================================================================*
       IDENTIFICATION                  DIVISION.
      *================================================================*

       PROGRAM-ID. CBTI9970.
       AUTHOR. **********.

      *================================================================*
      *                 TCS - TATA CONSULTANT SERVICES                 *
      *----------------------------------------------------------------*
      *    PROGRAMA....: CBTI9970                                      *
      *    PROGRAMADOR.: SILVIO FERREIRA                               *
      *    ANALISTA....: SILVIO FERREIRA                               *
      *    DATA........: OUTUBRO/2023                                  *
      *----------------------------------------------------------------*
      *    SISTEMA: CBTI - COBRANCA - TROCA DE INFORMACOES             *
      *    OBJETIVO......: LER ARQUIVO NO FORMATO CNAB400 CONTENDO DI- *
      *                    VERSOS LOTES E GERAR SAIDA COM UM UNICO LOTE*
      *                    CONFORME INDICADO EM PARM DE JCL.           *
      *----------------------------------------------------------------*
      *    ARQUIVOS                                                    *
      *    DDNAME    DESCRICAO                            INCLUDE/BOOK *
      *    VARIOSLO LOTES CNAB400 DE VARIAS EMPRESAS        I#CBTICB   *
      *    UNICOLOT LOTE CNAB400 DE UMA UNICA EMPRESA       I#CBTICB   *
      *----------------------------------------------------------------*
      *----------------------------------------------------------------*
      *    MODULO......:                                               *
      *    DDNAME    DESCRICAO                                         *
      *    BRAD7100  MODULO DE TRATAMENTO DE ERRO                      *
      *    BRAD0160  OBTER NOME DO JOB                                 *
      *    BRAD7600  OBTER DATA DO SISTEMA                             *
      *================================================================*

      *================================================================*
       ENVIRONMENT                     DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       CONFIGURATION                   SECTION.
      *----------------------------------------------------------------*
       SPECIAL-NAMES.
           DECIMAL-POINT               IS COMMA.

      *----------------------------------------------------------------*
       INPUT-OUTPUT SECTION.
      *----------------------------------------------------------------*
       FILE-CONTROL.

           SELECT  VARIOSLO  ASSIGN  TO  VARIOSLO
                   FILE      STATUS  IS  WRK-FS-VARIOSLO.

           SELECT  UNICOLOT  ASSIGN  TO  UNICOLOT
                   FILE      STATUS  IS  WRK-FS-UNICOLOT.

      *================================================================*
       DATA                            DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       FILE SECTION.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      *   INPUT:  ARQUIVO  VARIOSLO                                    *
      *            ORG. SEQUENCIAL  -  LRECL = 400                     *
      *----------------------------------------------------------------*
       FD  VARIOSLO
           RECORDING MODE IS F
           LABEL RECORD   IS STANDARD
           BLOCK CONTAINS 0 RECORDS.
       01  FD-REG-VARIOSLO             PIC X(400).

      *----------------------------------------------------------------*
      *   OUTPUT:  ARQUIVO  UNICOLOT                                   *
      *            ORG. SEQUENCIAL  -  LRECL = 400                     *
      *----------------------------------------------------------------*
       FD  UNICOLOT
           RECORDING MODE IS F
           LABEL RECORD   IS STANDARD
           BLOCK CONTAINS 0 RECORDS.
       01  FD-REG-UNICOLOT             PIC X(400).

      *================================================================*
       WORKING-STORAGE                 SECTION.
      *================================================================*

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(040)         VALUE
           '*** INICIO DA AREA DE WORKING ***      '.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(040)         VALUE
           '* VARIAVEIS DE FILE-STATUS *'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  WRK-FS-VARIOSLO             PIC  X(002)         VALUE SPACES.
       01  WRK-FS-UNICOLOT             PIC  X(002)         VALUE SPACES.
       01  WRK-ABERTURA                PIC  X(013)         VALUE
                                                          'NA ABERTURA'.
       01  WRK-LEITURA                 PIC  X(013)         VALUE
                                                           'NA LEITURA'.
       01  WRK-FECHAMENTO              PIC  X(013)         VALUE
                                                        'NO FECHAMENTO'.
       01  WRK-BATCH                   PIC  X(008)         VALUE
                                                                'BATCH'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE ACUMULADORES ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  ACU-LIDOS-VARIOSLO          PIC  9(009) COMP-3  VALUE ZEROS.
       01  ACU-GRAVADOS-UNICOLOT       PIC  9(009) COMP-3  VALUE ZEROS.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA PARA VARIAVEIS AUXILIARES ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  WRK-FIM-VARIOSLO            PIC  X(001)      VALUE SPACES.
       01  WRK-EDIT                    PIC  ZZZ.ZZZ.ZZ9 VALUE ZEROS.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '* MENSAGENS DE ERRO *'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       01  WRK-MSG-FS-ERRO.
           05 FILLER                   PIC  X(010)         VALUE SPACES.
           05 FILLER                   PIC  X(005)         VALUE 'ERRO'.
           05 WRK-OPERACAO             PIC  X(013)         VALUE SPACES.
           05 FILLER                   PIC  X(012)         VALUE
                                                           'DO ARQUIVO'.
           05 WRK-NOME-ARQ             PIC  X(009)         VALUE SPACES.
           05 FILLER                   PIC  X(014)         VALUE
                                                       'FILE STATUS = '.
           05 WRK-FILE-STATUS          PIC  X(002)         VALUE SPACES.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA PARA TRATAMENTO DE ERROS ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       COPY 'I#BRAD7C'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE ARQUIVOS ***             '.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       COPY 'I#CBTIRT'.

      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
       01  FILLER                    PIC  X(050)       VALUE
           '*** FIM DA AREA DE WORKING ***'.
      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *

       LINKAGE SECTION.
       01  LNK-PARM-CLIENTE.
           03  LNK-TAM-PARM        PIC 9(04)   COMP.
           03  LNK-PARAMETRO       PIC X(20).

      *================================================================*
       PROCEDURE DIVISION   USING LNK-PARM-CLIENTE.
      *================================================================*

      *----------------------------------------------------------------*
       0000-PRINCIPAL                  SECTION.
      *----------------------------------------------------------------*

           PERFORM  1000-INICIALIZAR.

           IF WRK-FIM-VARIOSLO EQUAL 'S'
              DISPLAY '                                 '
              DISPLAY '================================ '
              DISPLAY '*** NAO FOI ENCONTRADO O CLIENTE ' LNK-PARAMETRO
              DISPLAY '================================ '
              DISPLAY '                                 '
              PERFORM  3000-FINALIZAR
           END-IF.

           PERFORM  2000-PROCESSAR

           SUBTRACT 1 FROM ACU-LIDOS-VARIOSLO

           PERFORM  3000-FINALIZAR.

      *----------------------------------------------------------------*
       0000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
      *----------------------------------------------------------------*
       1000-INICIALIZAR                SECTION.
      *----------------------------------------------------------------*

           OPEN  INPUT  VARIOSLO
                 OUTPUT UNICOLOT.


           MOVE SPACES                 TO ERRO-AREA.

           MOVE WRK-ABERTURA           TO WRK-OPERACAO.

           PERFORM  1100-TESTAR-FILE-STATUS.

           PERFORM  1200-VERIFICAR-VAZIO.

           PERFORM  1300-LER-VARIOSLO UNTIL
                   (CBTIRT-COD-EMPRESA-H EQUAL LNK-PARAMETRO AND
                    CBTIRT-TIPO-REG-H    EQUAL ZEROS)
                                   OR
                    WRK-FIM-VARIOSLO     EQUAL 'S'.

      *----------------------------------------------------------------*
       1000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      *--------------------------------------------------------------*
       1100-TESTAR-FILE-STATUS         SECTION.
      *--------------------------------------------------------------*

           PERFORM  1110-TESTAR-FS-VARIOSLO.
           PERFORM  1130-TESTAR-FS-UNICOLOT.

      *--------------------------------------------------------------*
       1100-99-FIM.                    EXIT.
      *--------------------------------------------------------------*

      *--------------------------------------------------------------*
       1110-TESTAR-FS-VARIOSLO         SECTION.
      *--------------------------------------------------------------*

           IF  WRK-FS-VARIOSLO  NOT EQUAL  '00' AND '10'
               MOVE  'VARIOSLO'        TO WRK-NOME-ARQ
               MOVE  WRK-FS-VARIOSLO   TO WRK-FILE-STATUS
               PERFORM  9000-ROTINA-ERRO
           END-IF.

      *--------------------------------------------------------------*
       1110-99-FIM.                    EXIT.
      *--------------------------------------------------------------*
      *--------------------------------------------------------------*
       1130-TESTAR-FS-UNICOLOT         SECTION.
      *--------------------------------------------------------------*

           IF  WRK-FS-UNICOLOT  NOT EQUAL  '00' AND '10'
               MOVE  'UNICOLOT'        TO WRK-NOME-ARQ
               MOVE  WRK-FS-UNICOLOT   TO WRK-FILE-STATUS
               PERFORM  9000-ROTINA-ERRO
           END-IF.

      *--------------------------------------------------------------*
       1130-99-FIM.                    EXIT.
      *--------------------------------------------------------------*
      *----------------------------------------------------------------*
       1200-VERIFICAR-VAZIO                SECTION.
      *----------------------------------------------------------------*

           PERFORM  1300-LER-VARIOSLO.

           IF  WRK-FIM-VARIOSLO  EQUAL  'S'
               DISPLAY '********** VARIOSLO **********'
               DISPLAY '*                            *'
               DISPLAY '*   ARQUIVO VARIOSLO VAZIO   *'
               DISPLAY '*   PROGRAMA CANCELADO       *'
               DISPLAY '*                            *'
               DISPLAY '********** VARIOSLO **********'
               MOVE 'VARIOSLO'         TO WRK-NOME-ARQ
               PERFORM  3000-FINALIZAR
           ELSE
               CLOSE          VARIOSLO
               OPEN INPUT     VARIOSLO
               MOVE ZEROS  TO ACU-LIDOS-VARIOSLO
               PERFORM        1300-LER-VARIOSLO
           END-IF.

      *----------------------------------------------------------------*
       1200-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
      *----------------------------------------------------------------*
       1300-LER-VARIOSLO               SECTION.
      *----------------------------------------------------------------*

           READ  VARIOSLO                INTO  CBTIRT-CNAB0400.

           MOVE  WRK-LEITURA               TO  WRK-OPERACAO.

           PERFORM  1110-TESTAR-FS-VARIOSLO.

           IF  WRK-FS-VARIOSLO  EQUAL  '10'
               MOVE  'S'                   TO  WRK-FIM-VARIOSLO
.              GO TO 1300-99-FIM
           END-IF.

           ADD 1 TO ACU-LIDOS-VARIOSLO.

      *----------------------------------------------------------------*
       1300-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
      *----------------------------------------------------------------*
       2000-PROCESSAR                  SECTION.
      *----------------------------------------------------------------*

           PERFORM  2100-GRAVAR-UNICOLOT UNTIL
                                         CBTIRT-TIPO-REG-H EQUAL 9

           PERFORM  2100-GRAVAR-UNICOLOT.

      *----------------------------------------------------------------*
       2000-99-FIM.                        EXIT.
      *----------------------------------------------------------------*
      *----------------------------------------------------------------*
       2100-GRAVAR-UNICOLOT            SECTION.
      *----------------------------------------------------------------*

           WRITE  FD-REG-UNICOLOT      FROM  CBTIRT-CNAB0400

           PERFORM  1130-TESTAR-FS-UNICOLOT.

           ADD   1                     TO    ACU-GRAVADOS-UNICOLOT.

.          PERFORM 1300-LER-VARIOSLO.

      *----------------------------------------------------------------*
       2100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
      *----------------------------------------------------------------*
       3000-FINALIZAR                  SECTION.
      *----------------------------------------------------------------*

           CLOSE  VARIOSLO
                  UNICOLOT.

           MOVE   WRK-FECHAMENTO       TO  WRK-OPERACAO.

           PERFORM  1100-TESTAR-FILE-STATUS.

           PERFORM  3100-DISPLAY-PROCESSAMENTO.

           STOP RUN.

      *----------------------------------------------------------------*
       3000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
      *----------------------------------------------------------------*
       3100-DISPLAY-PROCESSAMENTO      SECTION.
      *----------------------------------------------------------------*

           DISPLAY
           '********************** CBTI9970 **********************'.
           DISPLAY
           '*                                                    *'
           DISPLAY
           '*             ESTATISTICA DE PROCESSAMENTO           *'
           DISPLAY
           '*                                                    *'

           MOVE  ACU-LIDOS-VARIOSLO    TO  WRK-EDIT
           DISPLAY
           '* REGISTROS LIDOS NO VARIOSLO   .......= ' WRK-EDIT ' *'

           MOVE  ACU-GRAVADOS-UNICOLOT  TO  WRK-EDIT
           DISPLAY
           '* REGISTROS GRAVADOS NO UNICOLOT.......= ' WRK-EDIT ' *'

           DISPLAY
           '*                                                    *'
           DISPLAY
           '********************** CBTI9970 **********************'.

      *----------------------------------------------------------------*
       3100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
      *----------------------------------------------------------------*
       9000-ROTINA-ERRO                SECTION.
      *----------------------------------------------------------------*

           MOVE  'CBTI9970'            TO  ERR-PGM
           MOVE  'APL'                 TO  ERR-TIPO-ACESSO.

           MOVE  WRK-MSG-FS-ERRO       TO  ERR-TEXTO.

           CALL  'BRAD7100'         USING  WRK-BATCH
                                           ERRO-AREA.

           GOBACK.

      *----------------------------------------------------------------*
       9000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
