//FSYS007E JOB 'FSYS007',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID,TIME=(0,10)
//JOBLIB   DD  DISP=SHR,DSN=FS.GERAL.LOADLIB
//STEP001  EXEC PGM=T1BS0703
//A1073104 DD  DSN=FS.FSYS007.A1073104,DISP=SHR
//A1073106 DD  DSN=FS.FSYS007.A1073106,DISP=SHR
//A1073107 DD  DSN=FS.FSYS007.A1073107,DISP=(OLD,CATLG,DELETE),
//             SPACE=(TRK,(1,1),RLSE),UNIT=SYSALLDA,
//             DCB=(LRECL=81,RECFM=FB,DSORG=PS)
