//FSYS007C JOB 'FSYS007',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID
//STEP0001 JCLLIB ORDER=FS.LB.PROCLIB
//COBCOMP  EXEC DFHCOBOL,NOME='E0073519'
//LKED.SYSIN    DD   *
  NAME E0073519(R)
