//FSYS007E JOB 'FSYS007',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID,TIME=(0,10)
//JOBLIB   DD  DISP=SHR,DSN=FS.GERAL.LOADLIB
//*---------------------------------------------------------------------
//*---------------------------------------------------------------------
//STEP001  EXEC PGM=EX007P18
//MOVTOEST DD  DSN=FS.FSYS998.MOVTOEST,DISP=SHR
//RELMOV01 DD  SYSOUT=*
