//FSYS007E JOB 'FSYS007',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID,TIME=(0,10)
//JOBLIB   DD  DISP=SHR,DSN=FS.GERAL.LOADLIB
//STEP001  EXEC PGM=EX007P21,PARM='20250201'
//MOVTOEST DD  DSN=FS.FSYS998.MOVTOEST,DISP=SHR
//CADPROD  DD  DSN=FS.FSYS998.CADPROD,DISP=SHR
//RELMOV01 DD  SYSOUT=*
