//FSYS007E JOB 'FSYS007',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID,TIME=(0,10)
//JOBLIB   DD  DISP=SHR,DSN=FS.GERAL.LOADLIB
//STEP001  EXEC PGM=REF007P2,PARM='015000200001000'
//RALLYTPO DD  DSN=FS.FSYS998.RALLYTPO,DISP=SHR
//RALLYCLA DD  DSN=FS.FSYS007.RALLYCLA,DISP=(NEW,CATLG,DELETE),
//             SPACE=(TRK,(1,1),RLSE),UNIT=SYSALLDA,
//             DCB=(LRECL=22,RECFM=FB,DSORG=PS)
