//FSYSNNNE JOB 'FSYS007',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID,TIME=(0,10)
//JOBLIB   DD  DISP=SHR,DSN=FS.GERAL.LOADLIB
//STEP001  EXEC PGM=EX007P09
//CLISP    DD  DSN=FS.FSYS998.CLISP,DISP=SHR
//CLIRJ    DD  DSN=FS.FSYS998.CLIRJ,DISP=SHR
//CLIMG    DD  DSN=FS.FSYS998.CLIMG,DISP=SHR
//CLIUNIF  DD  DSN=FS.FSYSNNN.CLIUNIF,DISP=(NEW,CATLG,DELETE),
//             SPACE=(TRK,(1,1),RLSE),UNIT=SYSALLDA,
//             DCB=(LRECL=94,RECFM=FB,DSORG=PS)
