//FSYS007E JOB 'FSYS007',MSGCLASS=X,CLASS=A,NOTIFY=FSYS007,TIME=(0,20)
//JOBLIB   DD  DISP=SHR,DSN=FS.GERAL.LOADLIB
//STEP001  EXEC PGM=EX007P13
//PSOLD    DD  DSN=FS.FSYS998.PSOLD,DISP=SHR
//PSMOV    DD  DSN=FS.FSYS998.PSMOV,DISP=SHR
//PSNEW    DD  DSN=FS.FSYS007.PSNEW,DISP=(NEW,CATLG,DELETE),
//             SPACE=(TRK,(1,1),RLSE),UNIT=SYSALLDA,
//             DCB=(LRECL=42,RECFM=FB,DSORG=PS,BLKSIZE=0)
