//FSYS012E JOB 'FSYS007',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID,TIME=(0,10)
//JOBLIB   DD  DISP=SHR,DSN=FS.GERAL.LOADLIB
//STEP001  EXEC PGM=EX012P05
//SIMUEMP  DD  DSN=FS.FSYS998.SIMUEMP,DISP=SHR
//EMPAPROV DD  DSN=FS.FSYS007.EMPAPROV,DISP=(NEW,CATLG,DELETE),
//             SPACE=(TRK,(1,1),RLSE),UNIT=SYSALLDA,
//             DCB=(LRECL=35,RECFM=FB,DSORG=PS)
