//FSYS007E JOB 'FSYS007',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID,TIME=(0,10)
//JOBLIB   DD  DISP=SHR,DSN=FS.GERAL.LOADLIB
//STEP001  EXEC PGM=EX007P06
//FUNCANT  DD  DSN=FS.FSYS998.FUNCANT,DISP=SHR
//FUNCNOVO DD  DSN=FS.FSYS998.FUNCNOVO,DISP=SHR
//FUNCCAD  DD  DSN=FS.FSYS007.FUNCCAD,DISP=(NEW,CATLG,DELETE),
//             SPACE=(TRK,(1,1),RLSE),UNIT=SYSALLDA,
//             DCB=(LRECL=43,RECFM=FB,DSORG=PS)
