//FSYS007E JOB 'FSYS007',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID,TIME=(0,10)
//JOBLIB   DD  DISP=SHR,DSN=FS.GERAL.LOADLIB
//STEP001  EXEC PGM=RF007N01
//FUNCTRAB DD  DSN=FS.FSYS007.FUNCTRAB,DISP=SHR
//FUNCPAG  DD  DSN=FS.FSYS007.FUNCPAG,DISP=(NEW,CATLG,DELETE),
//             SPACE=(TRK,(1,1),RLSE),UNIT=SYSALLDA,
//             DCB=(LRECL=35,RECFM=FB,DSORG=PS)
