//FSYS007E JOB 'FSYS007',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID,TIME=(0,10)
//JOBLIB   DD  DISP=SHR,DSN=FS.GERAL.LOADLIB
//STEP001  EXEC PGM=P107NX02
//EXTTDO24 DD  DSN=FS.FSYS007.EXTTDO24,DISP=SHR
//EXTTAO24 DD  DSN=FS.FSYS007.EXTTAO24,DISP=(NEW,CATLG,DELETE),
//             SPACE=(TRK,(1,1),RLSE),UNIT=SYSALLDA,
//             DCB=(LRECL=44,RECFM=FB,DSORG=PS)
