//FSYS007E JOB 'FSYS007',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID,TIME=(0,10)
//JOBLIB   DD  DISP=SHR,DSN=FS.GERAL.LOADLIB
//STEP001  EXEC PGM=T1BS0701
//A1073101 DD  DSN=FS.FSYS007.A1073101,DISP=SHR
//A1073102 DD  DSN=FS.FSYS007.A1073102,DISP=(NEW,CATLG,DELETE),
//             SPACE=(TRK,(1,1),RLSE),UNIT=SYSALLDA,
//             DCB=(LRECL=42,RECFM=FB,DSORG=PS)
