      ******************************************************************
      *               COBRANCA ESCRITURAL BRADESCO                     *
      *           ARQUIVO FORMATO CNAB DE 400 POSICOES                 *
      *    REMESSA DOS ARQUIVOS DE COBRANCA DOS TITULOS E CONFIRMACAO  *
      * DAS INTRUCOES DE PROTESTO, PRORROGACAO DE VENCIMENTO,BAIXAS,ETC*
FSYS19******************************************************************
.     *        ALTERACAO JANEIRO/2019 - MARCIO MAIA - FOURSYS          *
.     *   - INCLUSAO DO REGISTRO TIPO 7 -                              *
.     *     DADOS SACADOR/AVALISTA E TIPO DE PAGAMENTO(OPCIONAL)       *
FSYS19*----------------------------------------------------------------*
       01 REG-CNAB.
         03  REG-CNAB-HEADER.
      *** REGISTRO HEADER - TIPO '0'
      * 001 A 001 IDENTIFICACAO DO REGISTRO
           05 CNAB-TIPO-REG-H          PIC 9(1).
      * 002 A 002 IDENTIFICACAO DO ARQUIVO REMESSA
           05 CNAB-ID-ARQUIVO-H        PIC 9(1).
      * 003 A 009 LITERAL REMESSA
           05 CNAB-LTRAL-REMSS-H       PIC X(7).
      * 010 A 011 CODIGO DE SERVICO
           05 CNAB-COD-SERVC-H         PIC 9(2).
      * 012 A 026 LITERAL SERVICO
           05 CNAB-LTRAL-SERVC-H       PIC X(15).
      * 027 A 046 C?O DA EMPRESA
           05 CNAB-COD-EMPR-H          PIC X(20).
      * 047 A 076 NOME DA EMPRESA
           05 CNAB-NOME-EMPR-H         PIC X(30).
      * 077 A 079 NUMERO DO BRADESCO NA CAMARA DE COMPENSACAO
           05 CNAB-NBSCO-COMP-H        PIC 9(03).
      * 080 A 094 NOME DO BANCO POR EXTENSO
           05 CNAB-NOME-BANCO-H        PIC X(15).
      * 095 A 100 DATA DA GRAVACAO DO ARQUIVO - DDMMAA
           05 CNAB-DAT-GRV-ARQ-H       PIC 9(06).
      * 101 A 108 BRANCO
           05 CNAB-BRANCOS-1-H         PIC X(08).
      * 109 A 110 IDENTIFICACAO DO SISTEMA
           05 CNAB-ID-SIST-H           PIC X(02).
      * 111 A 117 NUMERO SEQUENCIAL DO ARQUIVO
           05 CNAB-NRO-SEQ-ARQ-H       PIC 9(07).
      * 118 A 394 BRANCO
           05 CNAB-BRANCOS-2-H         PIC X(277).
      * 395 A 400 N? SEQUENCIAL DO REGISTRO DE UM EM UM
           05 CNAB-NRO-SEQ-REG-H       PIC 9(06).

      *** REGISTRO TIPO '1'
        03  REG-CNAB-DET-1  REDEFINES  REG-CNAB-HEADER.
      * 001 A 001 IDENTIFICACAO DO REGISTRO
           05 CNAB-TIPO-REG            PIC 9(01).
      * 002 A 007 AGENCIA DE DEBITO E DIGITO DA AGENCIA
      * CODIGO DA AGENCIA DO SACADO EXCLUSIVO PARA DEBITO EM CONTA
           05 CNAB-AGENCIA-D1.
              07 CNAB-AGE-DEB          PIC 9(05).
              07 CNAB-DG-AGE-DEB       PIC X(01).
      * 008 A 012 RAZAO DA CONTA CORRENTE
      * 013 A 019 CONTA CORRENTE
      * 020 A 020 DIGITO DA CONTA CORRENTE
           05 CNAB-CTA-CORR-D1.
              07 CNAB-CONTA-CORR       PIC 9(12).
              07 FILLER  REDEFINES CNAB-CONTA-CORR.
                 09 CNAB-RAZ-CTA       PIC 9(05).
                 09 CNAB-CTA-CORR      PIC 9(07).
              07 CNAB-DG-CTA-CORR      PIC X(01).
      * 021 A 037 IDENTIFICACAO DA EMPRESA CEDENTE NO BANCO
      * ZERO, CARTEIRA, AGENCIA, CONTA CORRENTE
           05 CNAB-ID-EMPR-CED         PIC X(17).
      * 038 A 062 NUMERO CONTROLE DO PARTICIPANTE - USO DA EMPRESA
           05 CNAB-NRO-CTRL-PARTC      PIC X(25).
      * 063 A 065 COD. DO BANCO A SER DEBITADO NA CAMARA DE COMPENSACAO
      * NUMERO DO BANCO "237"
           05 CNAB-BCO-DEB-CCOMP       PIC 9(03).
      * 066 A 070 ZEROS
           05 CNAB-ZEROS               PIC 9(05).
      * 071 A 081 IDENTIFICACAO DO TITULO NO BANCO
      * NOSSO NUMERO PARA COBRANCA COM E SEM REGISTRO E
      * 082 A 082 DIGITO DE AUTO CONFERENCIA DO NOSSO NUMERO
           05 CNAB-ID-TITLO-BCO-D1.
              07 CNAB-ID-TITLO-BCO     PIC 9(11).
              07 CNAB-DG-AUTO-CONFE-NN PIC X(01).
      * 083 A 092 DESCONTO BONIFICACAO POR DIA
           05 CNAB-DESC-BONIF-DIA      PIC 9(10).
      * 093 A 093 CONDICAO PARA EMISSAO DA PAPELETA DE COBRANCA
      * 1 = BANCO EMITE E PROCESSA O REGISTRO
      * 2 = CLIENTE EMITE E O BANCO SOMENTE PROCESSA O REGISTRO
           05 CNAB-EMIS-PPLTA-COBR     PIC 9(01).
      * 094 A 094 IDENT. SE EMITE PAPELETA PARA DEBITO AUTOMATICO
      * 'N'= NAO REGISTRA NA COBRANCA
      * DIFERENTE DE 'N'= REGISTRA E EMITE PAPELETA
           05 CNAB-ID-PPLTA-DEB-AUTOM  PIC X(01).
      * 095 A 104 IDENTIFICACAO DA OPERACAO DO BANCO - BRANCOS
           05 CNAB-ID-OPER-BCO         PIC X(10).
      * 105 A 105 INDICADOR RATEIO CREDITO - "R"
           05 CNAB-ID-RTEIO-CRED       PIC X(01).
      * 106 A 106 ENDERECAMENTO PARA AVISO DO DEBITO AUTOMATICO EM
      * CONTA CORRENTE - 1, 2 OU DIFERENTE DE 1 E 2
           05 CNAB-AVISO-DEB-AUTON-CC  PIC 9(01).
      * 107 A 108 QUANTIDADE DE PARCELA
           05 CNAB-QTDE-PARCELA        PIC 9(02).
      * 109 A 110 IDENTIFICACAO OCORRENCIA - CODIGOS DE OCORRENCIA
           05 CNAB-ID-OCOR             PIC 9(02).
      * 111 A 120 NUMERO DO DOCUMENTO
           05 CNAB-NRO-DOCTO           PIC X(10).
      * 121 A 126 DATA DO VENCIMENTO DO TITULO - DDMMAA
           05 CNAB-DATA-VCTO-TITLO     PIC 9(06).
      * 127 A 139 VALOR DO TITULO
           05 CNAB-VLR-TITLO           PIC 9(13).
      * 140 A 142 BANCO ENCARREGADO DA COBRANCA
      * NUMERO DO BANCO NA CAMARA DE COMPENSACAO
           05 CNAB-BCO-ENCARRGDO-COBR  PIC 9(03).
      * 143 A 147 AGENCIA DEPOSITARIA - CODIGO DA AGENCIA DEPOSITARIA
           05 CNAB-AG-DEPOS            PIC 9(05).
      * 148 A 149 ESPECIE DE TITULO
      * 01-DUPLICATA
      * 02-NOTA PROMISSORIA
      * 03-NOTA DE SEGURO
      * 04-COBRANCA SERIADA
      * 05-RECIBO
      * 10-LETRAS DE CAMBIO
      * 11-NOTA DE DEBITO
      * 12-DUPLICATA DE SERVICO
      * 99-OUTROS
           05 CNAB-ESPCE-TITLO         PIC 9(02).
      * 150 A 150 IDENTIFICACAO
      * A=ACEITO  N=NAO ACEITO
           05 CNAB-IDENTIFICACAO       PIC X(01).
      * 151 A 156 DATA DA EMISSAO DO TITULO - DDMMAA
           05 CNAB-DATA-EMIS-TITLO     PIC 9(06).
      * 157 A 158 PRIMEIRA INSTRUCAO
           05 CNAB-PRIM-INSTR          PIC 9(02).
      * 159 A 160 SEGUNDA INSTRUCAO
           05 CNAB-SEGDA-INSTR         PIC 9(02).
      * 161 A 173 VALOR A SER COBRADO POR DIA DE ATRASO
           05 CNAB-VLR-COB-DIA-ATRSO   PIC 9(13).
      * 174 A 179 DATA LIMITE P/CONCESSAO DE DESCONTO -DDMMAA
           05 CNAB-DATA-CONCS-DESC     PIC 9(06).
      * 180 A 192 VALOR DO DESCONTO
           05 CNAB-VLR-DESC            PIC 9(13).
      * 193 A 205 VALOR DO IOF
           05 CNAB-VLR-IOF             PIC 9(13).
      * 206 A 218 VALOR DO ABATIMENTO A SER CONCEDIDO OU CANCELADO
           05 CNAB-VLR-ABTMT-CONCD     PIC 9(13).
      * 219 A 220 IDENTIFICACAO DO TIPO DE INSCRICAO DO SACADO
      * 01-CPF 02-CNPJ 03-PIS/PASEP 98-NAO TEM 99-OUTROS
           05 CNAB-ID-TP-INSCR-SACDO   PIC 9(02).
      * 221 A 234 NUMERO INSCRICAO DO SACADO - CNPJ/ CPF
           05 CNAB-NRO-INSCR-SACDO     PIC 9(14).
      * 235 A 274 NOME DO SACADO
           05 CNAB-NOME-SACDO          PIC X(40).
      * 275 A 314 ENDERECO COMPLETO - ENDERE? DO SACADO
           05 CNAB-ENDER-COPLT-SACDO   PIC X(40).
      * 315 A 326 PRIMEIRA MENSAGEM
           05 CNAB-PRIM-MSGEM          PIC X(12).
      * 327 A 331 CEP DO SACADO
      * 332 A 334 SUFIXO DO CEP
           05 CNAB-CEP-SACDO-D1.
              07 CNAB-CEP-SACDO        PIC 9(05).
              07 CNAB-SUFXO-CPF-SACDO  PIC 9(03).
      * 335 A 394 SACADOR/AVALISTA OU SEGDA MENSAGEM
           05 CNAB-SEGDA-MSGEM         PIC X(60).
      * 395 A 400 NUMERO SEQUENCIAL DO REGISTRO
           05 CNAB-NRO-SEQ-REG         PIC 9(06).

      *** REGISTRO TIPO '2'
        03  REG-CNAB-DET-2  REDEFINES  REG-CNAB-HEADER.
      * 001 A 001 TIPO REGISTRO
           05 CNAB-TIPO-REG-D2         PIC 9(01).
      * 002 A 081 MENSAGEM 1
           05 CNAB-MSGEM-01            PIC X(80).
      * 082 A 161 MENSAGEM 2
           05 CNAB-MSGEM-02            PIC X(80).
      * 162 A 241 MENSAGEM 3
           05 CNAB-MSGEM-03            PIC X(80).
      * 242 A 321 MENSAGEM 4
           05 CNAB-MSGEM-04            PIC X(80).
      * 322 A 366 RESERVA - FILLER
           05 CNAB-RESERVA             PIC X(45).
      * 367 A 369 NUMERO DA CARTEIRA
           05 CNAB-CARTEIRA            PIC 9(03).
      * 370 A 374 CODIGO DA AGENCIA CEDENTE
           05 CNAB-COD-AG-CDENT        PIC 9(05).
      * 375 A 381 CONTA CORRENTE
      * 382 A 382 DIGITO C/C - DAC C/C
           05 CNAB-CTA-CORRENTE.
              07 CNAB-CTA-CORR-D2      PIC 9(07).
              07 CNAB-DG-CTA-CORR-D2   PIC X(01).
      * 383 A 393 NOSSO NUMERO
      * 394 A 394 DAC NOSSO NUMERO
           05 CNAB-NOSSO-NRO-D2.
              07 CNAB-NOSSO-NRO        PIC 9(11).
              07 CNAB-DAC-NOSSO-NRO    PIC X(01).
      * 395 A 400 NUMERO SEQUENCIAL DE REGISTRO
           05 CNAB-NRO-SEQ-REG-D2      PIC 9(06).

      *** REGISTRO TIPO '3'
        03  REG-CNAB-DET-3  REDEFINES  REG-CNAB-HEADER.
      * 001 A 001 IDENTIFICACAO DO REGISTRO - FIXO "3"
           05 CNAB-NRO-SEQ-REG-D2      PIC 9(01).
      * 002 A 017 IDENTIFICACAO DA EMPRESA NO BANCO
      * CARTEIRA,AGENCIA,CONTA CORRENTE
           05 CNAB-ID-EMPR-BCO         PIC X(16).
      * 018 A 029 IDENTIFICACAO TITULO NO BANCO - NOSSO NUMERO
           05 CNAB-ID-TITLO-BCO-D3     PIC X(12).
      * 030 A 030 CODIGO DE CALCULO DO RATEIO
      * "1"=VL COBRADO "2"=VL DO REGISTRO "3"=RATEIO PELO MENOR VALOR
           05 CNAB-COD-CALC-RTEIO      PIC 9(01).
      * 031 A 031 TIPO DE VALOR INFORMADO - "1"= % "2"= VALOR
           05 CNAB-TIPO-VLR-INFMD      PIC 9(01).
      * 032 A 043 FILLER - BRANCOS
           05 CNAB-FILLER-01           PIC X(12).
      * 044 A 046 CODIGO DO BANCO PARA CREDITO DO PRIMEIRO BENEFICIARIO
      * FIXO "237"
           05 CNAB-COD-BCO-CRED-BNEFC  PIC 9(03).
      * 047 A 051 CODIGO DA AGENCIA PARA CREDITO PRIMEIRO BENEFICI?O
      * 052 A 052 DIGITO DA AG?CIA PARA CREDITO
           05 CNAB-COD-AG-CRED-BNEFC-D3.
              07 CNAB-COD-AG-CRED-BNEFC   PIC 9(05).
              07 CNAB-DG-AG-CRED-BNEFC    PIC X(01).
      * 053 A 064 NRO CONTA CORR PARA CREDITO DO PRIMEIRO BENEFICIARIO
      * 065 A 065 DIGITO CONTA CORR PARA CREDITO
           05 CNAB-CTA-CORR-CRED-BNEFC-D3.
              07 CNAB-CTA-CORR-CRED-BNEFC PIC 9(12).
              07 CNAB-DG-CTA-CRED-BNEFC   PIC X(01).
      * 066 A 080 VALOR, OU % PARA RATEIO
      * % = INFORMADO EM PERCENTUAIS COM REPRESENTACAO NA MASCARA DE
      * 000000000999999, ONDE TERA 3 DECIMAIS PARA CALCULO.
      * VALOR=VLR INFORMADO EM REAIS
           05 CNAB-VLR-OU-PERC-RTEIO-1 PIC 9(15).
      * 081 A 120 NOME DO PRIMEIRO BENEFICIARIO
           05 CNAB-NOME-PRIM-BNEFC     PIC X(40).
      * 121 A 151 FILLER - BRANCOS
           05 CNAB-FILLER-02           PIC X(31).
      * 152 A 157 IDENTIFICACAO DA PARCELA
           05 CNAB-PARCELA-01          PIC X(06).
      * 158 A 160 FLOATING PARA O PRIMEIRO BENEFICIARIO
           05 CNAB-FLOAT-PRIM-BNEFC    PIC 9(03).
      * 161 A 163 COD.BCO PARA CREDITO DO SEGUNDO BENEFICIARIO
      * FIXO "237"
           05 CNAB-BCO-CRED-SEG-BNEFC  PIC 9(03).
      * 164 A 168 COD.AGENCIA PARA CREDITO DO SEGUNDO BENEFICIARIO
      * 169 A 169 DIGITO DA AGENCIA
           05 CNAB-AG-CRED-SEG-BNEFC-D3.
              07 CNAB-AG-CRED-SEG-BNEFC   PIC 9(05).
              07 CNAB-DG-AG-SEG-BNEFC     PIC X(01).
      * 170 A 181 NRO DA CONTA CORR PARA CREDITO DO SEGUNDO BENEFICIARIO
      * 182 A 182 DIGITO DA CONTA CORRENTE
           05 CNAB-CTA-CORR-SEG-BNEFC-D3.
              07 CNAB-CTA-CORR-SEG-BNEFC  PIC 9(12).
              07 CNAB-DG-CTA-SEG-BNEFC    PIC X(01).
      * 183 A 197 VALOR, OU % PARA RATEIO
      * %= VALOR INFORMADO EM PERCENTUAIS COM REPRESENTACAO NA MASCARA
      * DE 000000000999999, ONDE TERA 3 DECIMAIS PARA CALCULO.
      * VALOR = VALOR INFORMADO EM VALOR
           05 CNAB-VLR-OU-PERC-RTEIO-2 PIC 9(15).
      * 198 A 237 NOME DO SEGUNDO BENEFICIARIO
           05 CNAB-NOME-SEGDO-BNEFC    PIC X(40).
      * 238 A 268 FILLER - BRANCOS
           05 CNAB-FILLER-03           PIC X(31).
      * 269 A 274 PARCELA - IDENTIFICACAO DA PARCELA
           05 CNAB-PARCELA-02          PIC X(06).
      * 275 A 277 FLOATING PARA O SEGUNDO BENEFICIARIO
      * QUANTIDADE DE DIAS PARA CREDITO DO BENEFICIARIO
           05 CNAB-FLOAT-SEGDO-BNEFC   PIC 9(03).
      * 278 A 280 COD.DO BANCO PARA CREDITO DO TERCEIRO BENEFICIARIO
      * FIXO "237"
           05 CNAB-BCO-CRED-TERC-BNEFC PIC 9(03).
      * 281 A 285 COD.DA AGENCIA PARA CREDITO DO TERCEIRO BENEFICIARIO
      * 286 A 286 DIGITO DA AGENCIA
           05 CNAB-AG-CRED-TERC-D3.
              07 CNAB-AG-CRED-TERC-BNEFC  PIC 9(05).
              07 CNAB-DG-AG-TERC-BNEFC    PIC X(01).
      * 287 A 298 NRO CONTA CORR PARA CREDITO DO TERCEIRO BENEFICIARIO
      * 299 A 299 DIGITO DA CONTA CORRENTE
           05 CNAB-CTA-CORR-TERC-D3.
              07 CNAB-CTA-CORR-TERC-BNEFC PIC 9(12).
              07 CNAB-DG-CTA-TERC-BNEFC   PIC X(01).
      * 300 A 314 VALOR, OU % PARA RATEIO
      * %= VALOR INFORMADO EM PERCENTUAIS COM REPRESENTACAO NA MASCARA
      * DE 000000000999999, ONDE TERA 3 DECIMAIS PARA CALCULO.
      * VALOR = VALOR INFORMADO EM VALOR
           05 CNAB-VLR-OU-PERC-RTEIO-3 PIC 9(15).
      * 315 A 354 NOME DO TERCEIRO BENEFICIARIO
           05 CNAB-NOME-TERC-BNEFC     PIC X(40).
      * 355 A 385 FILLER - BRANCOS
           05 CNAB-FILLER-04           PIC X(31).
      * 386 A 391 PARCELA - IDENTIFICACAO DA PARCELA
           05 CNAB-PARCELA-03          PIC X(06).
      * 392 A 394 FLOATING PARA TERCEIRO BENEFICIARIO
      * QUANTIDADE DE DIAS PARA CREDITO DO BENEFICIARIO.
           05 CNAB-FLOAT-TERC-BNEFC    PIC 9(03).
      * 395 A 400 NUMERO SEQUENCIAL DO REGISTRO
           05 CNAB-NRO-SEQ-REG-D3      PIC 9(06).

FSYS19*** REGISTRO - TIPO '7'
FSYS19*** DADOS DO SACADOR AVALISTA / TIPO DE PAGAMENTO (OPCIONAL)
FSYS19  03  REG-CNAB-DET-7             REDEFINES REG-CNAB-HEADER.
FSYS19* 001 A 001 IDENTIFICACAO DO REGISTRO
FSYS19     05 CNAB-TIPO-REG-7          PIC 9(001).
FSYS19* 002 A 046 ENDERECO SACADOR/AVALISTA
FSYS19     05 CNAB-ENDER-SAC-AVAL-7    PIC X(045).
FSYS19* 047 A 051 CEP DO SACADOR
FSYS19     05 CNAB-CEP-SACADOR-AVAL-7.
FSYS19        10 CNAB-CEP-SAC-AVAL-7   PIC 9(005).
FSYS19* 052 A 054 SUFIXO CEP DO SACADOR
FSYS19        10 CNAB-SUF-CEP-SAC-7    PIC 9(003).
FSYS19* 055 A 074 CIDADE DO SACADOR/AVALISTA
FSYS19     05 CNAB-CIDADE-SACADOR-7    PIC X(020).
FSYS19* 075 A 076 UF SACADOR/AVALISTA
FSYS19     05 CNAB-UF-SACA-AVAL-7      PIC X(002).
FSYS19* 077 A 078 TIPO DE PAGAMENTO
FSYS19**  01-ACEITA QUALQUER VALOR / 02-ENTRE O MINIMO E O MAXIMO
FSYS19**  03-NAO ACEITA PAGTO DIVERGENTE (NAO TRATADO PELO BANCO)
FSYS19     05 CNAB-TIPO-PAGTO-7        PIC 9(002).
FSYS19* 079 A 079 TIPO DE VALOR MAXIMO INFORMADO
FSYS19**  1 - PERCENTUAL / 2 - VALOR
FSYS19     05 CNAB-TIPO-VLR-MAX-7      PIC 9(001).
FSYS19* 080 A 094 PERCENTUAL / VALOR MAXIMO
FSYS19     05 CNAB-VL-MAX-PGTO-7       PIC 9(013)V99.
FSYS19     05 CNAB-PC-MAX-PGTO-7       REDEFINES
FSYS19        CNAB-VL-MAX-PGTO-7       PIC 9(010)V9(5).
FSYS19* 095 A 095 TIPO DE VALOR MINIMO INFORMADO
FSYS19**  1 - PERCENTUAL / 2 - VALOR
FSYS19     05 CNAB-TIPO-VLR-MIN-7      PIC 9(001).
FSYS19* 096 A 110 PERCENTUAL / VALOR MINIMO
FSYS19     05 CNAB-VL-MIN-PGTO-7       PIC 9(013)V99.
FSYS19     05 CNAB-PC-MIN-PGTO-7       REDEFINES
FSYS19        CNAB-VL-MIN-PGTO-7       PIC 9(010)V9(5).
FSYS19* 111 A 366 RESERVA
FSYS19     05 CNAB-RESERVA-7           PIC X(256).
FSYS19* 367 A 369 NUMERO DA CARTEIRA SACADOR/AVALISTA
FSYS19     05 CNAB-CART-SACAD-AVAL-7   PIC 9(003).
FSYS19* 370 A 374 CODIGO DA AGENCIA DO SACADOR/AVALISTA
FSYS19     05 CNAB-AG-SACAD-AVAL-7     PIC 9(005).
FSYS19* 375 A 381 NUMERO DA CONTA CORRENTE SACADOR/AVALISTA
FSYS19     05 CNAB-CT-SACAD-AVAL-7     PIC 9(007).
FSYS19* 382 A 382 DIGITO CONTA CORRENT SACADOR/AVALISTA
FSYS19     05 CNAB-DIG-CT-SACAD-AVAL-7 PIC X(001).
FSYS19* 383 A 393 NOSSO NUMERO
FSYS19     05 CNAB-NOSSO-NUMERO-7      PIC 9(011).
FSYS19* 394 A 394 DIGITO NOSSO NUMERO
FSYS19     05 CNAB-DIG-NNUMERO-7       PIC X(001).
FSYS19* 395 A 400 NUMERO SEQUENCIAL DE REGISTRO
FSYS19     05 CNAB-NRO-SEQ-REG-7       PIC 9(006).

      *** REGISTRO TRAILLER - TIPO '9'
        03  REG-CNAB-DET-T  REDEFINES  REG-CNAB-HEADER.
      * 001 A 001 IDENTIFICACAO DO REGISTRO
           05 CNAB-TIPO-REG-T          PIC 9(01).
      * 002 A 394 BRANCO - BRANCOS
           05 CNAB-BRANCO-T            PIC X(393).
      * 395 A 400 NUMERO SEQUENCIAL DO ULTIMO REGISTRO
           05 CNAB-NRO-SEQ-REG-T       PIC 9(06).

